Public Attributes | List of all members
API_CWallLineComponent Struct Reference
Attribute Management
Describes the lines separate the simple fills contained in composite structures. More...
#include <APIdefs_Attributes.h>
 Public Attributes
 API_AttributeIndex  | ltypeInd
The index of the skin face's line type attribute (1..n, where n is the number of not symbol line type attributes).
 short  | linePen
The index of the skin's face line pen [0..255]. 0 means the skin face line is hidden.
Detailed Description
Describes the lines separate the simple fills contained in composite structures.